MyTutorials/incompressible/damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4432;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4482;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          62;
        startFace       4532;
    }
    atmosphere
    {
        type            patch;
        nFaces          46;
        startFace       4594;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4536;
        startFace       4640;
    }
)

// ************************************************************************* //
